Tekla Open API Reference for Tekla Structures 2025
BentPlateGeometrySolver.SetMainSection Method
 Sets newMainSection as a main section of geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ConnectiveGeometry SetMainSection(
	GeometrySection newMainSection,
	ConnectiveGeometry geometry
)
Public Function SetMainSection (
	newMainSection As GeometrySection,
	geometry As ConnectiveGeometry
) As ConnectiveGeometry
Parameters
newMainSection
Type: Tekla.Structures.Model.GeometrySection
Geometry section to set as main section.
geometry
Type: Tekla.Structures.Model.ConnectiveGeometry
Connective geometry to modify.
Return Value
Type: ConnectiveGeometry
Connective geometry with newMainSection as main section.
Exceptions
Exception | Condition
ArgumentException | Throws an ArgumentException exception if the input newMainSection is not a polygon section.
See Also
Reference
BentPlateGeometrySolver Class
Tekla.Structures.Model Namespace